indexxue/esp32-s3/desktop_pet/sdkconfig.defaults
# N16R8 + dual OTA (see flash_partition/partitions_16m_n16r8.md).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Custom partition table (dual slot: app_a=ota_0, app_b=ota_1). See doc/partition_switch_development_plan.md.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../flash_partition/partitions_16m_n16r8.csv"

# Auto-start SoftAP + HTTP after BoardInit (see components/web_ctrl/README.md).
CONFIG_WEB_CTRL_AUTO_START=y

# BoardInit runs on app_main; keep headroom after moving web_ctrl_start to web_boot task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# --- N16R8 performance (R8 = 8MB OPI PSRAM; see flash_partition/partitions_16m_n16r8.md) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# 默认 16KB 以下都挤内部 RAM，听写时 free_int≈20KB 会触发 WS write 失败断连。
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# CPU 240MHz (ESP32-S3 max). Flash stays DIO@80M (WROOM-1 N16R8 quad flash; WROOM-2 oct flash is optional).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Release-style app optimization (smaller/slower than debug; better throughput for SD/LCD paths).
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# OTA rollback + SoftAP local OTA (see doc/ota_development_plan.md).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK is not set
# CONFIG_OTA_ROLLBACK_TEST is not set
CONFIG_OTA_HTTPS_PULL=y
CONFIG_WEB_CTRL_OTA=y
CONFIG_WEB_CTRL_OTA_UPLOAD_MAX=8388608
CONFIG_WEB_CTRL_OTA_CLOUD_PULL=y

# LVGL 9 (desktop_pet UI on GC9A01 240x240)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# Fallback when SD pet/font/caption.bin missing (~1k SC glyphs)
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_14_CJK=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
# Large SD bin fonts need heap in PSRAM (clib + SPIRAM_USE_MALLOC)
CONFIG_LV_USE_CLIB_MALLOC=y
# Load caption.bin via fopen("/sdcard/...") — letter 'S' (83)
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_CACHE_SIZE=512
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y

# Xiaozhi agent: official cloud (LAN Docker: empty OTA URL + ws://<PC>:8000/xiaozhi/v1/)
CONFIG_DESKTOP_PET_AGENT_ENABLE=y
CONFIG_DESKTOP_PET_AGENT_WS_URI="wss://api.tenclass.net/xiaozhi/v1/"
CONFIG_DESKTOP_PET_AGENT_ACCESS_TOKEN="test-token"
CONFIG_DESKTOP_PET_AGENT_OTA_URL="https://api.tenclass.net/xiaozhi/ota/"
CONFIG_DESKTOP_PET_AGENT_HELLO_TIMEOUT_MS=15000
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# TLS handshake was dying with -0x2880 (X509 alloc) on internal RAM.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# Skin files use long names (sleep_loop_0.bin) and web upload writes them.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# ESP-SR WakeNet: models on SD (/sdcard/sr_models/...), not flashed model partition.
CONFIG_MODEL_IN_SDCARD=y
CONFIG_SR_WN_WN9S_HILEXIN=y

# httpd stop→start after chat: without SO_REUSE, listen/bind returns errno 112 (EADDRINUSE).
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y
# httpd needs max_open_sockets+3; agent WS also holds fds — 10 is too tight (listen 112).
CONFIG_LWIP_MAX_SOCKETS=16
